#define _CRT_SECURE_NO_WARNINGS 1

//	____                      ____
///	|	|                  / |    |
//|	|	|                  | |____|
//|	|	|                  |/____/
//|	|	|                   ______
//|	|	|                 / |     |  
//|	|	|______________   | |     |  
//|	|__________________|  | |     |
//|/___________________/  | |_____|
//                        | /_____/	
//

#include<iostream>

int main()
{
	//∂ØÃ¨…Í«Î
	int* p = new int;
	// Õ∑≈
	delete p;
	p = NULL;
	return 0;
}